---
kind: property
id: P:Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.ResourceTypeId
source: html/f2894a9c-a514-ef1c-0368-1f491f36d221.htm
---
# Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.ResourceTypeId Property

Element id of the linked resource.

## Syntax (C#)
```csharp
public ElementId ResourceTypeId { get; }
```